fr/olpc-deployment-guide-lexique.org
#+TITLE: ONE LAPTOP PER CHILD -- GUIDE DE DEPLOIEMENT 2011 -- Lexique
#+AUTHOR: OLPC Foundation (c) 2011 One Laptop Per Child Association, Inc.
#+DATE: 2011-09-12
#+DESCRIPTION: ONE LAPTOP PER CHILD GUIDE DE DEPLOIEMENT 2011
#+KEYWORDS: ONE LAPTOP PER CHILD GUIDE DE DEPLOIEMENT 2011
#+OPTIONS: toc:nil

* A

** Activité

Application possédant une icône dans la barre de tâches, comme les
Activités Ecrire, Enregistrer ou Naviguer ; elles permettent de prendre une
photo, lire un livre, créer ou annoter une page, animer un dessin, créer
des sons et de la musique, etc. Elles possèdent l'extension de fichier .xo
; /voir aussi section 8.1.2./

** Adaptateur secteur (ou électrique)

Chaque XO est fourni avec un adaptateur permettant de le brancher sur une
prise électrique ; /voir aussi section 8.1.2./

** ADSL

Internet à haut débit.

** Apprentissage ; /voir section 2./

Assistance : /voir Support./

Ateliers : /voir Support./

* B

** Bibliothèque

- numérique : Dès le moment où un déploiement a accès au Wifi - et donc à
  Internet – il (et donc les élèves, les enseignants et la communauté dans
  son entier) a accès à une bibliothèque virtuelle de X (Merci à quelqu'un
  de compléter la quantité) ouvrages dans différentes langues et sur
  différents thèmes ; /voir aussi section 9.4.3./

- XO : Le contenu créé sur le XO est accessible via le Journal ; le contenu
  téléchargé est stocké dans la Bibliothèque, et est accessible via
  l'Activité Naviguer.

** Blog

« Journal sur Internet » ; défini souvent comme un site personnel, il
s'agit d'un espace individuel d'expression, créé pour donner la parole à
tous les internautes (particuliers, entreprises, artistes, hommes
politiques, associations...)

* C

** Carte-mère

Circuit imprimé principal se trouvant au centre de l'ordinateur. Tous les
composants du XO sont connectés à la carte-mère ; elle contient les
connexions pour le processeur, la mémoire, les cartes d'extension et les
périphériques de stockage.

** Centre d'appel ; /voir section 6.2./

** Chat (ou Tchat ou messagerie instantanée)

Permet l'échange instantané de messages textuels et de fichiers entre
plusieurs ordinateurs connectés au même réseau informatique, et plus
communément celui d'Internet. Contrairement au courrier électronique, ce
moyen de communication est caractérisé par le fait que les messages
s'affichent en quasi-temps-réel et permettent un dialogue interactif.

** Clavier ; /voir section 8.1.1./

** Collaboration (ou collaboratif)

Etudes ou travaux interactifs faits à l'aide d'ordinateurs interconnectés.

** Commande ; /voir section 8. et ss./

** Communauté/s

Ensemble des groupes scolaire, familial et culturel gravitant autour des
élèves et pour lequel l'introduction d'un déploiement entraînera des
conséquences.

** Connectivité

Capacité d'un système à se connecter à d'autres systèmes.

** Constructionnisme ; /voir section 2./

** Contenu (ou objets)

Correspond à des livres, films, photographies, dessins, musiques et autres
objets créés avec et dans le XO ou téléchargés sur celui-ci ; le contenu
(ou les objets) est stocké dans des fichiers possédant l'extension .xo1. ;
/voir aussi sections 9.2.2 et 10.1./

* D

** Déploiement

Mise à disposition (après leur acquisition auprès d'OLPC) d'un certain
nombre de XO à différents systèmes scolaires comprenant des élèves de 6 à
12 ans, et dans tous les pays du monde ; /voir aussi section 1.2./

* E

** Equipe

- principale (ou de déploiement) ; /voir sections 4.1. et 9.2./
- OLPC ; /voir section 9.2.1./
- éducative ; /voir section 9.2. et ss./
- technique ; /voir section 9.2. et ss./
- logistique ; /voir section 9.2. et ss./

** Ethernet

Protocole de réseau informatique local à commutation de paquets.

** Etoys

Environnement graphique de type micro-monde utilisé pour concevoir et
programmer graphiquement des objets. Cet environnement permet de concevoir
d'enrichissants scénarii pédagogiques ; c'est l'une des Activités du XO.

* F

** Fedora ; /voir GNU-Linux/

** Formation et ateliers ; /voir Support/

** Format

Ce qui définit un fichier informatique : extension précédée d'un « . »
Exemple avec comme nom de fichier « Déploiement 2011 » :

- Déploiement 2011.doc (format Word pour PC)
- Déploiement 2011.odt (format Open Source Document)
- Déploiement 2011.pdf (Portable Document Format), etc.
- .xo : correspond à une Activité sur le XO
- .xol : correspond à un contenu (ou un objet) dans le XO

** Forum

Espace de discussion publique (ou du moins ouvert à plusieurs participants)
sur Internet. Les discussions y sont archivées, ce qui permet une
communication asynchrone.

* G

** Garantie ; /voir Incoterms/
** GNU/Linux

Alternative libre aux systèmes propriétaires tels que Microsoft Windows et
Mac OS X qui permet le fonctionnement d'applications telles que les
navigateurs web, les systèmes de gestion de base de données, les clients de
messagerie, les environnements de bureau, les logiciels de retouche et de
traitement d'images, les jeux, etc.  Le système avec toutes ces
applications est ainsi distribué sous l'appellation « distribution
GNU/Linux », parmi lesquelles Ubuntu, Red Hat, Debian, Slackware, qui sont
destinées aux ordinateurs personnels comme aux serveurs informatiques.

