fr/html/olpc-deployment-guide-lexique.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>ONE LAPTOP PER CHILD &ndash; GUIDE DE DEPLOIEMENT 2011 &ndash; Lexique</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="ONE LAPTOP PER CHILD &ndash; GUIDE DE DEPLOIEMENT 2011 &ndash; Lexique"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-12"/>
<meta name="author" content="OLPC Foundation (c) 2011 One Laptop Per Child Association, Inc."/>
<meta name="description" content="ONE LAPTOP PER CHILD GUIDE DE DEPLOIEMENT 2011"/>
<meta name="keywords" content="ONE LAPTOP PER CHILD GUIDE DE DEPLOIEMENT 2011"/>
<link rel="stylesheet" href="style.css" type="text/css" />
</head>
<body>


<div id="content">
<h1 class="title">ONE LAPTOP PER CHILD &ndash; GUIDE DE DEPLOIEMENT 2011 &ndash; Lexique</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">A</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Activité</h3>
<div class="outline-text-3" id="text-1-1">


<p>
Application possédant une icône dans la barre de tâches, comme les
Activités Ecrire, Enregistrer ou Naviguer ; elles permettent de prendre une
photo, lire un livre, créer ou annoter une page, animer un dessin, créer
des sons et de la musique, etc. Elles possèdent l'extension de fichier .xo
; <i>voir aussi section 8.1.2.</i>
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Adaptateur secteur (ou électrique)</h3>
<div class="outline-text-3" id="text-1-2">


<p>
Chaque XO est fourni avec un adaptateur permettant de le brancher sur une
prise électrique ; <i>voir aussi section 8.1.2.</i>
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">ADSL</h3>
<div class="outline-text-3" id="text-1-3">


<p>
Internet à haut débit.
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Apprentissage ; <i>voir section 2.</i></h3>
<div class="outline-text-3" id="text-1-4">


<p>
Assistance : <i>voir Support.</i>
</p>
<p>
Ateliers : <i>voir Support.</i>
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">B</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Bibliothèque</h3>
<div class="outline-text-3" id="text-2-1">


<ul>
<li>numérique : Dès le moment où un déploiement a accès au Wifi - et donc à
  Internet – il (et donc les élèves, les enseignants et la communauté dans
  son entier) a accès à une bibliothèque virtuelle de X (Merci à quelqu'un
  de compléter la quantité) ouvrages dans différentes langues et sur
  différents thèmes ; <i>voir aussi section 9.4.3.</i>

</li>
<li>XO : Le contenu créé sur le XO est accessible via le Journal ; le contenu
  téléchargé est stocké dans la Bibliothèque, et est accessible via
  l'Activité Naviguer.
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Blog</h3>
<div class="outline-text-3" id="text-2-2">


<p>
« Journal sur Internet » ; défini souvent comme un site personnel, il
s'agit d'un espace individuel d'expression, créé pour donner la parole à
tous les internautes (particuliers, entreprises, artistes, hommes
politiques, associations&hellip;)
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">C</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Carte-mère</h3>
<div class="outline-text-3" id="text-3-1">


<p>
Circuit imprimé principal se trouvant au centre de l'ordinateur. Tous les
composants du XO sont connectés à la carte-mère ; elle contient les
connexions pour le processeur, la mémoire, les cartes d'extension et les
périphériques de stockage.
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Centre d'appel ; <i>voir section 6.2.</i></h3>
<div class="outline-text-3" id="text-3-2">


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Chat (ou Tchat ou messagerie instantanée)</h3>
<div class="outline-text-3" id="text-3-3">


<p>
Permet l'échange instantané de messages textuels et de fichiers entre
plusieurs ordinateurs connectés au même réseau informatique, et plus
communément celui d'Internet. Contrairement au courrier électronique, ce
moyen de communication est caractérisé par le fait que les messages
s'affichent en quasi-temps-réel et permettent un dialogue interactif.
</p>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">Clavier ; <i>voir section 8.1.1.</i></h3>
<div class="outline-text-3" id="text-3-4">


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">Collaboration (ou collaboratif)</h3>
<div class="outline-text-3" id="text-3-5">


<p>
Etudes ou travaux interactifs faits à l'aide d'ordinateurs interconnectés.
</p>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">Commande ; <i>voir section 8. et ss.</i></h3>
<div class="outline-text-3" id="text-3-6">


</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">Communauté/s</h3>
<div class="outline-text-3" id="text-3-7">


<p>
Ensemble des groupes scolaire, familial et culturel gravitant autour des
élèves et pour lequel l'introduction d'un déploiement entraînera des
conséquences.
</p>
</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8">Connectivité</h3>
<div class="outline-text-3" id="text-3-8">


<p>
Capacité d'un système à se connecter à d'autres systèmes.
</p>
</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9">Constructionnisme ; <i>voir section 2.</i></h3>
<div class="outline-text-3" id="text-3-9">


</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10">Contenu (ou objets)</h3>
<div class="outline-text-3" id="text-3-10">


<p>
Correspond à des livres, films, photographies, dessins, musiques et autres
objets créés avec et dans le XO ou téléchargés sur celui-ci ; le contenu
(ou les objets) est stocké dans des fichiers possédant l'extension .xo1. ;
<i>voir aussi sections 9.2.2 et 10.1.</i>
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">D</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Déploiement</h3>
<div class="outline-text-3" id="text-4-1">


<p>
Mise à disposition (après leur acquisition auprès d'OLPC) d'un certain
nombre de XO à différents systèmes scolaires comprenant des élèves de 6 à
12 ans, et dans tous les pays du monde ; <i>voir aussi section 1.2.</i>
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">E</h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">Equipe</h3>
<div class="outline-text-3" id="text-5-1">


<ul>
<li>principale (ou de déploiement) ; <i>voir sections 4.1. et 9.2.</i>
</li>
<li>OLPC ; <i>voir section 9.2.1.</i>
</li>
<li>éducative ; <i>voir section 9.2. et ss.</i>
</li>
<li>technique ; <i>voir section 9.2. et ss.</i>
</li>
<li>logistique ; <i>voir section 9.2. et ss.</i>
</li>
</ul>


</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">Ethernet</h3>
<div class="outline-text-3" id="text-5-2">


<p>
Protocole de réseau informatique local à commutation de paquets.
</p>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3">Etoys</h3>
<div class="outline-text-3" id="text-5-3">


<p>
Environnement graphique de type micro-monde utilisé pour concevoir et
programmer graphiquement des objets. Cet environnement permet de concevoir
d'enrichissants scénarii pédagogiques ; c'est l'une des Activités du XO.
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">F</h2>
<div class="outline-text-2" id="text-6">



</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Fedora ; <i>voir GNU-Linux</i></h3>
<div class="outline-text-3" id="text-6-1">


</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">Formation et ateliers ; <i>voir Support</i></h3>
<div class="outline-text-3" id="text-6-2">


</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3">Format</h3>
<div class="outline-text-3" id="text-6-3">


<p>
Ce qui définit un fichier informatique : extension précédée d'un « . »
Exemple avec comme nom de fichier « Déploiement 2011 » :
</p>
<ul>
<li>Déploiement 2011.doc (format Word pour PC)
</li>
<li>Déploiement 2011.odt (format Open Source Document)
</li>
<li>Déploiement 2011.pdf (Portable Document Format), etc.
</li>
<li>.xo : correspond à une Activité sur le XO
</li>
<li>.xol : correspond à un contenu (ou un objet) dans le XO
</li>
</ul>


</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4">Forum</h3>
<div class="outline-text-3" id="text-6-4">


<p>
Espace de discussion publique (ou du moins ouvert à plusieurs participants)
sur Internet. Les discussions y sont archivées, ce qui permet une
communication asynchrone.
</p>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">G</h2>
<div class="outline-text-2" id="text-7">



</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">Garantie ; <i>voir Incoterms</i></h3>
<div class="outline-text-3" id="text-7-1">

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2">GNU/Linux</h3>
<div class="outline-text-3" id="text-7-2">


<p>
Alternative libre aux systèmes propriétaires tels que Microsoft Windows et
Mac OS X qui permet le fonctionnement d'applications telles que les
navigateurs web, les systèmes de gestion de base de données, les clients de
messagerie, les environnements de bureau, les logiciels de retouche et de
traitement d'images, les jeux, etc.  Le système avec toutes ces
applications est ainsi distribué sous l'appellation « distribution
GNU/Linux », parmi lesquelles Ubuntu, Red Hat, Debian, Slackware, qui sont
destinées aux ordinateurs personnels comme aux serveurs informatiques.
</p>
</div>

</div>
