fr/olpc-deployment-guide-lexique.org
** Guide

- « Guide de déploiement » : Apporte toutes les informations concernant un
  déploiement OLPC et ses différentes phases.

- « Guide de l'ordinateur » : Apporte toutes les informations concernant
  l'utilisation du XO.

- « Guide Sugar » : Pour tout savoir sur l'interface du XO.

- « Le XO dans la salle de classe » : Destiné aux enseignants, il apporte
  des exemples et des idées d'utilisation des Activités (origine :
  déploiement OLPC Pérou)

- « Plan Ceibal » : Informe sur le fonctionnement du Plan Ceibal (OLPC
  Uruguay) de façon extrêmement précise et détaillée; /voir point 10./
  (n'existe qu'en espagnol pour l'instant mais en principe disponible en
  2013 en français.)

* I
  
** Incoterms (ou Garantie) 

Termes commerciaux, dont la règlementation est édictée et publiée par la
Chambre de commerce internationale de Paris.  /Voir aussi sections
8.2.1. et 8.2.2./

* J

** Journal (Journaux) 

Activité du XO sur laquelle vous pouvez voir et reprendre des travaux
précédents réalisés dans les Activités ; permet également à l'enseignant de
vérifier les progrès de ses élèves, /voir aussi section 9.4.3./

* L

** Logistique ;  /voir sections 9.1 et ss./

* M

** Mémoire

- NAND : Système de stockage interne du XO ; /voir aussi section 8.1.3./

- RAM (Random Access Memory). Par opposition à la mémoire fixe (ROM), la
  mémoire RAM (ou mémoire vive) peut être modifiée à l'infini dès qu'elle
  est alimentée en électricité. Elle sert à stocker temporairement les
  fichiers que l'ordinateur exécute. Il en existe de nombreux types. 

** Messagerie instantanée (ou Chat ou Tchat) ; /voir Chat/

** Multidiffusion (ou Multicast)

Forme de diffusion d'un émetteur unique vers un groupe de récepteurs. Les
termes « diffusion multipoint » ou « diffusion de groupe » sont également
employés.

* O

** Objet ; /voir Contenu/

** OLPC

One Laptop Per Child ; /voir section 1.1./

** Open Source

Plateforme ou fichier dont la licence respecte les critères établis par
l'Open Source Initiative : Libre redistribution ainsi qu'accès aux codes
source et aux travaux dérivés.

* P

** Papert, Seymour ; /voir section 2./

** Phase

- de planification ; /voir section 6/
- de déploiement ; /voir section 9/
- de post-déploiement ; /voir section 10/

** Piaget, Jean ; /voir section 2./

** Pièces détachées (ou de rechange) ; /voir section 9.1.3./

** Point d'accès (AP)

Dispositif permettant à plusieurs XO de se connecter afin de former un
réseau ; se connecte habituellement à un réseau câblé et relaie les données
entre les XO sans fil et les XO câblés ; plusieurs AP peuvent se relier
afin de former un réseau plus grand.

** Portail

Site web qui offre une porte d'entrée unique sur un large éventail de
ressources et de services (courrier électronique, forum de discussion,
espaces de publication, moteur de recherche) centrés sur un domaine ou une
communauté particulière. Les utilisateurs ont la plupart du temps la
possibilité de s'y enregistrer pour s'y connecter ultérieurement et y
utiliser l'ensemble des services proposés.

** Principes clés ; /voir sections 1.2. et 6.2.2/

** Proxy (ou serveur Proxy)

Ordinateur ou module qui sert d'intermédiaire entre un navigateur Web et
Internet. Le proxy participe à la sécurité du réseau.

** Python

Langage de programmation libre ; langage multi-paradigme, il n'impose pas
aux développeurs un type de programmation précis mais leur laisse adopter
celui de leur choix. Il permet ainsi la programmation orientée objet,
impérative structurée ou encore fonctionnelle.

* R

** Re-flash stick (ou reflasher)

Processus par lequel on réinitialise le système du XO ; le « reflashage »
écrase (annule) tous les fichiers, même ceux du Journal ou du
répertoire/home/olpc : demande donc à être utilisé avec précaution !

** Réseau (ou mode) maillé

Réseau dont tous les hôtes sont connectés de proche en proche sans
hiérarchie centrale, formant ainsi une structure en forme de filet. Cela
permet d'éviter des points sensibles qui, en cas de panne, couperaient la
connexion d'une partie du réseau : si un hôte est hors service, ses voisins
emprunteront automatiquement une autre voie.

Réseaux maillés OLPC :

- simple : fonctionne entre différents XO sans recours à un serveur d'école.
- avec serveur d'école : est relayé par un serveur d'école.
- portail : sert de portail pour un réseau extérieur au maillage

* S

** Serveur

- d'école (ou XS) : Augmente la quantité de données disponibles pour les
  enfants ; sert aussi de bibliothèque locale et de portail (ou réseau ou
  mode) pour l'accès Internet ; /voir aussi section 9.4.3./

- Proxy (ou Proxy réseau) ; /voir P/

** Stagiaires (ou volontaires) ; /voir section. 5.4./

** Sugar

Interface du XO constituée de quatre Vues, du Cadre et du Journal ; /voir
aussi section 2./

** Support (ou assistance ou formation) ; /voir section 5./

- opérationnel ; /voir section 5.1./
- éducatif / des enseignants ; /voir section 5.2./
- technique ; /voir section 5.3./
- par des volontaires ou stagiaires ; /voir section 5.4./
- initial ; /voir sections 6.2. et  9.3.1./
- continu ; /voir sections 6.2. et 10.1./

* T

** Tchat (/voir Chat)/

* V

** Vidéoconférence

Téléconférence permettant la transmission de la parole, de documents
graphiques et des images animées de participants à distance.

