fr/html/olpc-deployment-guide-lexique.html

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3">Guide</h3>
<div class="outline-text-3" id="text-7-3">


<ul>
<li>« Guide de déploiement » : Apporte toutes les informations concernant un
  déploiement OLPC et ses différentes phases.

</li>
<li>« Guide de l'ordinateur » : Apporte toutes les informations concernant
  l'utilisation du XO.

</li>
<li>« Guide Sugar » : Pour tout savoir sur l'interface du XO.

</li>
<li>« Le XO dans la salle de classe » : Destiné aux enseignants, il apporte
  des exemples et des idées d'utilisation des Activités (origine :
  déploiement OLPC Pérou)

</li>
<li>« Plan Ceibal » : Informe sur le fonctionnement du Plan Ceibal (OLPC
  Uruguay) de façon extrêmement précise et détaillée; <i>voir point 10.</i>
  (n'existe qu'en espagnol pour l'instant mais en principe disponible en
  2013 en français.)
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">I</h2>
<div class="outline-text-2" id="text-8">



</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1">Incoterms (ou Garantie)</h3>
<div class="outline-text-3" id="text-8-1">


<p>
Termes commerciaux, dont la règlementation est édictée et publiée par la
Chambre de commerce internationale de Paris.  <i>Voir aussi sections 8.2.1. et 8.2.2.</i>
</p>
</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">J</h2>
<div class="outline-text-2" id="text-9">



</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1">Journal (Journaux)</h3>
<div class="outline-text-3" id="text-9-1">


<p>
Activité du XO sur laquelle vous pouvez voir et reprendre des travaux
précédents réalisés dans les Activités ; permet également à l'enseignant de
vérifier les progrès de ses élèves, <i>voir aussi section 9.4.3.</i>
</p>
</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">L</h2>
<div class="outline-text-2" id="text-10">



</div>

<div id="outline-container-10-1" class="outline-3">
<h3 id="sec-10-1">Logistique ;  <i>voir sections 9.1 et ss.</i></h3>
<div class="outline-text-3" id="text-10-1">


</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">M</h2>
<div class="outline-text-2" id="text-11">



</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1">Mémoire</h3>
<div class="outline-text-3" id="text-11-1">


<ul>
<li>NAND : Système de stockage interne du XO ; <i>voir aussi section 8.1.3.</i>

</li>
<li>RAM (Random Access Memory). Par opposition à la mémoire fixe (ROM), la
  mémoire RAM (ou mémoire vive) peut être modifiée à l'infini dès qu'elle
  est alimentée en électricité. Elle sert à stocker temporairement les
  fichiers que l'ordinateur exécute. Il en existe de nombreux types. 
</li>
</ul>


</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2">Messagerie instantanée (ou Chat ou Tchat) ; <i>voir Chat</i></h3>
<div class="outline-text-3" id="text-11-2">


</div>

</div>

<div id="outline-container-11-3" class="outline-3">
<h3 id="sec-11-3">Multidiffusion (ou Multicast)</h3>
<div class="outline-text-3" id="text-11-3">


<p>
Forme de diffusion d'un émetteur unique vers un groupe de récepteurs. Les
termes « diffusion multipoint » ou « diffusion de groupe » sont également
employés.
</p>
</div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">O</h2>
<div class="outline-text-2" id="text-12">



</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1">Objet ; <i>voir Contenu</i></h3>
<div class="outline-text-3" id="text-12-1">


</div>

</div>

<div id="outline-container-12-2" class="outline-3">
<h3 id="sec-12-2">OLPC</h3>
<div class="outline-text-3" id="text-12-2">


<p>
One Laptop Per Child ; <i>voir section 1.1.</i>
</p>
</div>

</div>

<div id="outline-container-12-3" class="outline-3">
<h3 id="sec-12-3">Open Source</h3>
<div class="outline-text-3" id="text-12-3">


<p>
Plateforme ou fichier dont la licence respecte les critères établis par
l'Open Source Initiative : Libre redistribution ainsi qu'accès aux codes
source et aux travaux dérivés.
</p>
</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">P</h2>
<div class="outline-text-2" id="text-13">



</div>

<div id="outline-container-13-1" class="outline-3">
<h3 id="sec-13-1">Papert, Seymour ; <i>voir section 2.</i></h3>
<div class="outline-text-3" id="text-13-1">


</div>

</div>

<div id="outline-container-13-2" class="outline-3">
<h3 id="sec-13-2">Phase</h3>
<div class="outline-text-3" id="text-13-2">


<ul>
<li>de planification ; <i>voir section 6</i>
</li>
<li>de déploiement ; <i>voir section 9</i>
</li>
<li>de post-déploiement ; <i>voir section 10</i>
</li>
</ul>


</div>

</div>

<div id="outline-container-13-3" class="outline-3">
<h3 id="sec-13-3">Piaget, Jean ; <i>voir section 2.</i></h3>
<div class="outline-text-3" id="text-13-3">


</div>

</div>

<div id="outline-container-13-4" class="outline-3">
<h3 id="sec-13-4">Pièces détachées (ou de rechange) ; <i>voir section 9.1.3.</i></h3>
<div class="outline-text-3" id="text-13-4">


</div>

</div>

<div id="outline-container-13-5" class="outline-3">
<h3 id="sec-13-5">Point d'accès (AP)</h3>
<div class="outline-text-3" id="text-13-5">


<p>
Dispositif permettant à plusieurs XO de se connecter afin de former un
réseau ; se connecte habituellement à un réseau câblé et relaie les données
entre les XO sans fil et les XO câblés ; plusieurs AP peuvent se relier
afin de former un réseau plus grand.
</p>
</div>

</div>

<div id="outline-container-13-6" class="outline-3">
<h3 id="sec-13-6">Portail</h3>
<div class="outline-text-3" id="text-13-6">


<p>
Site web qui offre une porte d'entrée unique sur un large éventail de
ressources et de services (courrier électronique, forum de discussion,
espaces de publication, moteur de recherche) centrés sur un domaine ou une
communauté particulière. Les utilisateurs ont la plupart du temps la
possibilité de s'y enregistrer pour s'y connecter ultérieurement et y
utiliser l'ensemble des services proposés.
</p>
</div>

</div>

<div id="outline-container-13-7" class="outline-3">
<h3 id="sec-13-7">Principes clés ; <i>voir sections 1.2. et 6.2.2</i></h3>
<div class="outline-text-3" id="text-13-7">


</div>

</div>

<div id="outline-container-13-8" class="outline-3">
<h3 id="sec-13-8">Proxy (ou serveur Proxy)</h3>
<div class="outline-text-3" id="text-13-8">


<p>
Ordinateur ou module qui sert d'intermédiaire entre un navigateur Web et
Internet. Le proxy participe à la sécurité du réseau.
</p>
</div>

</div>

<div id="outline-container-13-9" class="outline-3">
<h3 id="sec-13-9">Python</h3>
<div class="outline-text-3" id="text-13-9">


<p>
Langage de programmation libre ; langage multi-paradigme, il n'impose pas
aux développeurs un type de programmation précis mais leur laisse adopter
celui de leur choix. Il permet ainsi la programmation orientée objet,
impérative structurée ou encore fonctionnelle.
</p>
</div>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14">R</h2>
<div class="outline-text-2" id="text-14">



</div>

<div id="outline-container-14-1" class="outline-3">
<h3 id="sec-14-1">Re-flash stick (ou reflasher)</h3>
<div class="outline-text-3" id="text-14-1">


<p>
Processus par lequel on réinitialise le système du XO ; le « reflashage »
écrase (annule) tous les fichiers, même ceux du Journal ou du
répertoire/home/olpc : demande donc à être utilisé avec précaution !
</p>
</div>

</div>

<div id="outline-container-14-2" class="outline-3">
<h3 id="sec-14-2">Réseau (ou mode) maillé</h3>
<div class="outline-text-3" id="text-14-2">


<p>
Réseau dont tous les hôtes sont connectés de proche en proche sans
hiérarchie centrale, formant ainsi une structure en forme de filet. Cela
permet d'éviter des points sensibles qui, en cas de panne, couperaient la
connexion d'une partie du réseau : si un hôte est hors service, ses voisins
emprunteront automatiquement une autre voie.
</p>
<p>
Réseaux maillés OLPC :
</p>
<ul>
<li>simple : fonctionne entre différents XO sans recours à un serveur d'école.
</li>
<li>avec serveur d'école : est relayé par un serveur d'école.
</li>
<li>portail : sert de portail pour un réseau extérieur au maillage
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15">S</h2>
<div class="outline-text-2" id="text-15">



</div>

<div id="outline-container-15-1" class="outline-3">
<h3 id="sec-15-1">Serveur</h3>
<div class="outline-text-3" id="text-15-1">


<ul>
<li>d'école (ou XS) : Augmente la quantité de données disponibles pour les
  enfants ; sert aussi de bibliothèque locale et de portail (ou réseau ou
  mode) pour l'accès Internet ; <i>voir aussi section 9.4.3.</i>

</li>
<li>Proxy (ou Proxy réseau) ; <i>voir P</i>
</li>
</ul>


</div>

</div>

<div id="outline-container-15-2" class="outline-3">
<h3 id="sec-15-2">Stagiaires (ou volontaires) ; <i>voir section. 5.4.</i></h3>
<div class="outline-text-3" id="text-15-2">


</div>

</div>

<div id="outline-container-15-3" class="outline-3">
<h3 id="sec-15-3">Sugar</h3>
<div class="outline-text-3" id="text-15-3">


<p>
Interface du XO constituée de quatre Vues, du Cadre et du Journal ; <i>voir aussi section 2.</i>
</p>
</div>

</div>

<div id="outline-container-15-4" class="outline-3">
<h3 id="sec-15-4">Support (ou assistance ou formation) ; <i>voir section 5.</i></h3>
<div class="outline-text-3" id="text-15-4">


<ul>
<li>opérationnel ; <i>voir section 5.1.</i>
</li>
<li>éducatif / des enseignants ; <i>voir section 5.2.</i>
</li>
<li>technique ; <i>voir section 5.3.</i>
</li>
<li>par des volontaires ou stagiaires ; <i>voir section 5.4.</i>
</li>
<li>initial ; <i>voir sections 6.2. et  9.3.1.</i>
</li>
<li>continu ; <i>voir sections 6.2. et 10.1.</i>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16">T</h2>
<div class="outline-text-2" id="text-16">



</div>

<div id="outline-container-16-1" class="outline-3">
<h3 id="sec-16-1">Tchat (<i>voir Chat)</i></h3>
<div class="outline-text-3" id="text-16-1">


</div>
</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17">V</h2>
<div class="outline-text-2" id="text-17">



</div>

<div id="outline-container-17-1" class="outline-3">
<h3 id="sec-17-1">Vidéoconférence</h3>
<div class="outline-text-3" id="text-17-1">


<p>
Téléconférence permettant la transmission de la parole, de documents
graphiques et des images animées de participants à distance.
</p>
</div>

</div>
